app/Controllers/Auth.php

    public function processLogin()
    {
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Invalid input data'
            ]);
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'felicisimojv@gmail.com'
 LIMIT 1

    public function processRegister()
    {
        $rules = [
            'name' => 'required|min_length[3]',
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'confirm_password' => 'required|matches[password]'
        ];

        if (!$this->validate($rules)) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => implode('<br>', $this->validator->getErrors())
            ]);
        }

        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'password' => $this->request->getPost('password'),
            'created_at' => date('Y-m-d H:i:s')
        ];

        try {
            if ($this->userModel->insert($data)) {
---
INSERT INTO `users` (`name`, `email`, `password`, `created_at`) VALUES ('John Gregg', 'jgreggfel@gmail.com', '$2y$10$HPF7/7FYOjIeXBc4taki5ONwfBFsWgLGNJzJuaQIKDkeGSS3oIM0i', '2024-12-16 09:33:45')

    public function testConnection()
    {
        try {
            $user = $this->userModel->first();
---
SELECT *
FROM `users`
 LIMIT 1