app/Controllers/Consultation.php

  public function store()
  {
    $data = [
      'patient_name' => $this->request->getPost('patient_name'),
      'age' => $this->request->getPost('age'),
      'gender' => $this->request->getPost('gender'),
      'contact_number' => $this->request->getPost('contact_number'),
      'visit_date' => date('Y-m-d H:i:s'),
      'symptoms' => $this->request->getPost('symptoms'),
      'diagnosis' => $this->request->getPost('diagnosis'),
      'treatment' => $this->request->getPost('treatment'),
      'prescribed_medicines' => $this->request->getPost('prescribed_medicines'),
      'notes' => $this->request->getPost('notes'),
      'next_visit' => $this->request->getPost('next_visit')
    ];

    try {
      if ($this->consultationModel->insert($data)) {
---
INSERT INTO `consultations` (`patient_name`, `age`, `gender`, `contact_number`, `visit_date`, `symptoms`, `diagnosis`, `treatment`, `prescribed_medicines`, `notes`, `next_visit`, `created_at`, `updated_at`) VALUES ('grgg', '29', 'Male', '09917822877', '2024-12-16 09:57:23', 'Baliw', 'di ko alam', 'awan ko ', 'Biogesic', 'waal naman', '2024-12-20', '2024-12-16 09:57:23', '2024-12-16 09:57:23')

  public function get($id)
  {
    return $this->response->setJSON($this->consultationModel->find($id));
---
SELECT *
FROM `consultations`
WHERE `consultations`.`id` = '1'