app/Controllers/Dashboard.php

    public function index()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $data = [
            'totalMedicines' => $this->medicineModel->getTotalMedicines(),
            'totalStock' => $this->medicineModel->getTotalStock(),
            'expiredMedicines' => $this->medicineModel->getExpiredCount(),
            'medicines' => $this->medicineModel->findAll()
---
SELECT *
FROM `medicines`