app/Controllers/Dashboard.php

SELECT *
FROM `consultations`
ORDER BY `visit_date` DESC
---
    public function index()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $data = [
            'activePatients' => $this->consultationModel->getActivePatients(),
            'weeklyCases' => $this->consultationModel->getWeeklyCases(),
            'totalRecords' => $this->consultationModel->getTotalRecords(),
            'consultations' => $this->consultationModel->orderBy('visit_date', 'DESC')->findAll()