app/Models/ConsultationModel.php

SELECT DISTINCT `patient_name`
FROM `consultations`
WHERE `next_visit` >= '2024-12-16'
OR DATE(visit_date) = '2024-12-16'
---
  public function getActivePatients()
  {
    $today = date('Y-m-d');
    $subquery = $this->db->table('consultations')
      ->select('patient_name')
      ->where('next_visit >=', $today)
      ->orWhere('DATE(visit_date)', $today)
      ->distinct()
      ->getCompiledSelect();

SELECT COUNT(*) AS `numrows`
FROM `consultations`
WHERE `visit_date` >= '2024-12-09'
---
  public function getWeeklyCases()
  {
    $lastWeek = date('Y-m-d', strtotime('-7 days'));
    return $this->where('visit_date >=', $lastWeek)
      ->countAllResults();

SELECT COUNT(*) AS `numrows` FROM `consultations`
---
  public function getTotalRecords()
  {
    return $this->countAll();