app/Models/MedicineModel.php

SELECT COUNT(*) AS `numrows` FROM `medicines`
---
    public function getTotalMedicines()
    {
        return $this->countAll();

SELECT SUM(`stock`) AS `stock`
FROM `medicines`
---
    public function getTotalStock()
    {
        return $this->selectSum('stock')->get()->getRow()->stock ?? 0;

SELECT COUNT(*) AS `numrows`
FROM `medicines`
WHERE `isExpired` = 'yes'
---
    public function getExpiredCount()
    {
        return $this->where('isExpired', 'yes')->countAllResults();